src/poems.org
#+title: Poems - A Collection of Poems That Have Resonated With Me
#+author: Alex Drysdale
#+date: <2025-09-01 Mon>
#+export_date: Mon, 01 Sep 2025 00:00:01 GMT
#+html_head_extra: <link rel="icon" type="image/x-icon" href="/resources/favicon.jpeg">
#+filetags: :poetry:

A collection of poems that have resonated with me on some level or that I've simply enjoyed. Sorted by poet.

* Fletcher, John (1579-162)
** The River-God's Song

#+begin_example
Do not feat to they feet
Naked in the river sweet;
Think not leech or newt or toad
Will bite thy foot when thou hast trod;
Nor let the water rising high
As thou wad'st in make thee cry
And sob, but ever live with me,
And not a wave shall trouble thee.
#+end_example

* Plath, Sylvia (1932-1963)
** The Moon and the Yew Tree

#+begin_example
This is the light of the mind, cold and planetary,
The trees of the mind are black. The light is blue.
The grasses unload their griefs on my feet as if I were God
Prickling my ankles and murmuring of their humility
Fumy, spiritous mists inhabit this place.
Separated from my house by a row of headstones.
I simply cannot see where there is to get to.

The moon is no door. It is a face in its own right,
White as a knuckle and terribly upset.
It drags the sea after it like a dark crime; it is quiet
With the O-gape of complete despair. I live here.
Twice on Sunday, the bells startle the sky --
Eight great tongues affirming the Resurrection
At the end, they soberly bong out their names.

The yew tree points up, it has a Gothic shape.
The eyes lift after it and find the moon.
The moon is my mother. She is not sweet like Mary.
Her blue garments unloose small bats and owls.
How I would like to believe in tenderness -
The face of the effigy, gentled by candles,
Bending, on me in particular, its mild eyes.

I have fallen a long way. Clouds are flowering
Blue and mystical over the face of the stars
Inside the church, the saints will all be blue,
Floating on their delicate feet over the cold pews,
Their hands and faces stiff with holiness.
The moon sees nothing of this. She is bald and wild.
And the message of the yew tree is blackness - blackness and silence.
#+end_example

* Teasdale, Sara (1884-1933)
** The River

#+begin_example
I came from the sunny valleys
And sought for the open sea,
For I thought in its gray expanses
My peace would come to me.

I came at least to the ocean
And found it wild and black,
And I cried to the windless valleys,
"Be kind and take me back!"

But the thirsty tide ran inland,
And the salt waves drank of me,
And I who was fresh as the rainfall
Am bitter to the sea.
#+end_example

* Thoreau, Henry David (1817-1862)
** I Was Born Upon Thy Bank, River

#+begin_example
I was born upon thy bank, river,
    My blood flows in thy stream,
And thou meanderest forever
    At the bottom of my dream
#+end_example


