docs/poems.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Poems - A Collection of Poems That Have Resonated With Me</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet"href="resources/org.css"type="text/css" /><header><a href="index.html">Home</a>&emsp;<a href="about.html">About Me</a>&emsp;<a href="https://github.com/abdrysdale/abdrysdale.github.io">Source</a>&emsp;<a href="sitemap.html">Sitemap</a>&emsp;<a href="feed.xml">RSS</a></header>
<link rel="icon" type="image/x-icon" href="/resources/favicon.jpeg">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Poems - A Collection of Poems That Have Resonated With Me</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgfdfe3f1">Fletcher, John (1579-162)</a></li>
<li><a href="#org0afc748">Plath, Sylvia (1932-1963)</a></li>
<li><a href="#orge5d96bc">Teasdale, Sara (1884-1933)</a></li>
<li><a href="#org8537292">Thoreau, Henry David (1817-1862)</a></li>
</ul>
</div>
</div>
<p>
A collection of poems that have resonated with me on some level or that I've simply enjoyed. Sorted by poet.
</p>

<div id="outline-container-orgfdfe3f1" class="outline-2">
<h2 id="orgfdfe3f1">Fletcher, John (1579-162)</h2>
<div class="outline-text-2" id="text-orgfdfe3f1">
</div>
<ul class="org-ul">
<li><a id="orgbfb6094"></a>The River-God's Song<br />
<div class="outline-text-3" id="text-orgbfb6094">
<pre class="example" id="org8d69280">
Do not feat to they feet
Naked in the river sweet;
Think not leech or newt or toad
Will bite thy foot when thou hast trod;
Nor let the water rising high
As thou wad'st in make thee cry
And sob, but ever live with me,
And not a wave shall trouble thee.
</pre>
</div>
</li>
</ul>
</div>

<div id="outline-container-org0afc748" class="outline-2">
<h2 id="org0afc748">Plath, Sylvia (1932-1963)</h2>
<div class="outline-text-2" id="text-org0afc748">
</div>
<ul class="org-ul">
<li><a id="org22071a6"></a>The Moon and the Yew Tree<br />
<div class="outline-text-3" id="text-org22071a6">
<pre class="example" id="org92af750">
This is the light of the mind, cold and planetary,
The trees of the mind are black. The light is blue.
The grasses unload their griefs on my feet as if I were God
Prickling my ankles and murmuring of their humility
Fumy, spiritous mists inhabit this place.
Separated from my house by a row of headstones.
I simply cannot see where there is to get to.

The moon is no door. It is a face in its own right,
White as a knuckle and terribly upset.
It drags the sea after it like a dark crime; it is quiet
With the O-gape of complete despair. I live here.
Twice on Sunday, the bells startle the sky --
Eight great tongues affirming the Resurrection
At the end, they soberly bong out their names.

The yew tree points up, it has a Gothic shape.
The eyes lift after it and find the moon.
The moon is my mother. She is not sweet like Mary.
Her blue garments unloose small bats and owls.
How I would like to believe in tenderness -
The face of the effigy, gentled by candles,
Bending, on me in particular, its mild eyes.

I have fallen a long way. Clouds are flowering
Blue and mystical over the face of the stars
Inside the church, the saints will all be blue,
Floating on their delicate feet over the cold pews,
Their hands and faces stiff with holiness.
The moon sees nothing of this. She is bald and wild.
And the message of the yew tree is blackness - blackness and silence.
</pre>
</div>
</li>
</ul>
</div>

<div id="outline-container-orge5d96bc" class="outline-2">
<h2 id="orge5d96bc">Teasdale, Sara (1884-1933)</h2>
<div class="outline-text-2" id="text-orge5d96bc">
</div>
<ul class="org-ul">
<li><a id="orgc967422"></a>The River<br />
<div class="outline-text-3" id="text-orgc967422">
<pre class="example" id="orgebb4021">
I came from the sunny valleys
And sought for the open sea,
For I thought in its gray expanses
My peace would come to me.

I came at least to the ocean
And found it wild and black,
And I cried to the windless valleys,
"Be kind and take me back!"

But the thirsty tide ran inland,
And the salt waves drank of me,
And I who was fresh as the rainfall
Am bitter to the sea.
</pre>
</div>
</li>
</ul>
</div>

<div id="outline-container-org8537292" class="outline-2">
<h2 id="org8537292">Thoreau, Henry David (1817-1862)</h2>
<div class="outline-text-2" id="text-org8537292">
</div>
<ul class="org-ul">
<li><a id="org0e3e9a5"></a>I Was Born Upon Thy Bank, River<br />
<div class="outline-text-3" id="text-org0e3e9a5">
<pre class="example" id="org0927e07">
I was born upon thy bank, river,
    My blood flows in thy stream,
And thou meanderest forever
    At the bottom of my dream
</pre>
</div>
</li>
</ul>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2025-09-01 Mon 00:00</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
